----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
         LeakyReLU-2           [-1, 64, 28, 28]               0
            Conv2d-3           [-1, 64, 28, 28]          36,928
         LeakyReLU-4           [-1, 64, 28, 28]               0
         MaxPool2d-5           [-1, 64, 14, 14]               0
            Conv2d-6          [-1, 128, 14, 14]          73,856
         LeakyReLU-7          [-1, 128, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]         147,584
         LeakyReLU-9          [-1, 128, 14, 14]               0
        MaxPool2d-10            [-1, 128, 7, 7]               0
           Conv2d-11            [-1, 256, 7, 7]         295,168
        LeakyReLU-12            [-1, 256, 7, 7]               0
           Conv2d-13            [-1, 256, 7, 7]         590,080
        LeakyReLU-14            [-1, 256, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         590,080
        LeakyReLU-16            [-1, 256, 7, 7]               0
        MaxPool2d-17            [-1, 256, 3, 3]               0
          Flatten-18                 [-1, 2304]               0
           Linear-19                  [-1, 512]       1,180,160
        LeakyReLU-20                  [-1, 512]               0
          Dropout-21                  [-1, 512]               0
           Linear-22                  [-1, 256]         131,328
        LeakyReLU-23                  [-1, 256]               0
          Dropout-24                  [-1, 256]               0
           Linear-25                   [-1, 10]           2,570
================================================================
Total params: 3,048,394
Trainable params: 3,048,394
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 3.07
Params size (MB): 11.63
Estimated Total Size (MB): 14.70
----------------------------------------------------------------
epoch:1 train loss:1.1916 train acc:0.5495 val loss:0.6841 val acc:0.7407 time_cost:0m44s lr:1e-05
epoch:2 train loss:0.7125 train acc:0.7293 val loss:0.5676 val acc:0.7767 time_cost:1m27s lr:1e-05
epoch:3 train loss:0.6227 train acc:0.7645 val loss:0.5060 val acc:0.8011 time_cost:2m9s lr:1e-05
epoch:4 train loss:0.5673 train acc:0.7877 val loss:0.4767 val acc:0.8148 time_cost:2m51s lr:1e-05
epoch:5 train loss:0.5198 train acc:0.8073 val loss:0.4283 val acc:0.8472 time_cost:3m33s lr:1e-05
epoch:6 train loss:0.4812 train acc:0.8238 val loss:0.4063 val acc:0.8507 time_cost:4m15s lr:1e-05
epoch:7 train loss:0.4528 train acc:0.8331 val loss:0.3802 val acc:0.8626 time_cost:4m58s lr:1e-05
epoch:8 train loss:0.4291 train acc:0.8453 val loss:0.3642 val acc:0.8668 time_cost:5m40s lr:1e-05
epoch:9 train loss:0.4078 train acc:0.8525 val loss:0.3539 val acc:0.8701 time_cost:6m22s lr:1e-05
epoch:10 train loss:0.3913 train acc:0.8581 val loss:0.3399 val acc:0.8743 time_cost:7m4s lr:1e-05
epoch:11 train loss:0.3745 train acc:0.8649 val loss:0.3244 val acc:0.8805 time_cost:7m47s lr:1e-05
epoch:12 train loss:0.3643 train acc:0.8668 val loss:0.3136 val acc:0.8861 time_cost:8m29s lr:1e-05
epoch:13 train loss:0.3470 train acc:0.8745 val loss:0.3025 val acc:0.8878 time_cost:9m11s lr:1e-05
epoch:14 train loss:0.3374 train acc:0.8769 val loss:0.2945 val acc:0.8909 time_cost:9m53s lr:1e-05
epoch:15 train loss:0.3272 train acc:0.8805 val loss:0.2948 val acc:0.8908 time_cost:10m36s lr:1e-05
epoch:16 train loss:0.3182 train acc:0.8850 val loss:0.2833 val acc:0.8968 time_cost:11m18s lr:1e-05
epoch:17 train loss:0.3093 train acc:0.8876 val loss:0.2757 val acc:0.8987 time_cost:12m0s lr:1e-05
epoch:18 train loss:0.3011 train acc:0.8910 val loss:0.2724 val acc:0.9010 time_cost:12m43s lr:1e-05
epoch:19 train loss:0.2952 train acc:0.8935 val loss:0.2741 val acc:0.8997 time_cost:13m25s lr:1e-05
epoch:20 train loss:0.2856 train acc:0.8959 val loss:0.2586 val acc:0.9050 time_cost:14m7s lr:1e-05
