----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
         LeakyReLU-2           [-1, 64, 28, 28]               0
            Conv2d-3           [-1, 64, 28, 28]          36,928
         LeakyReLU-4           [-1, 64, 28, 28]               0
         MaxPool2d-5           [-1, 64, 14, 14]               0
            Conv2d-6          [-1, 128, 14, 14]          73,856
         LeakyReLU-7          [-1, 128, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]         147,584
         LeakyReLU-9          [-1, 128, 14, 14]               0
        MaxPool2d-10            [-1, 128, 7, 7]               0
           Conv2d-11            [-1, 256, 7, 7]         295,168
        LeakyReLU-12            [-1, 256, 7, 7]               0
           Conv2d-13            [-1, 256, 7, 7]         590,080
        LeakyReLU-14            [-1, 256, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         590,080
        LeakyReLU-16            [-1, 256, 7, 7]               0
        MaxPool2d-17            [-1, 256, 3, 3]               0
          Flatten-18                 [-1, 2304]               0
           Linear-19                  [-1, 512]       1,180,160
        LeakyReLU-20                  [-1, 512]               0
          Dropout-21                  [-1, 512]               0
           Linear-22                  [-1, 256]         131,328
        LeakyReLU-23                  [-1, 256]               0
          Dropout-24                  [-1, 256]               0
           Linear-25                   [-1, 10]           2,570
================================================================
Total params: 3,048,394
Trainable params: 3,048,394
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 3.07
Params size (MB): 11.63
Estimated Total Size (MB): 14.70
----------------------------------------------------------------
epoch:1 train loss:0.5768 train acc:0.7907 val loss:0.3564 val acc:0.8657 time_cost:0m50s lr:0.001
epoch:2 train loss:0.3401 train acc:0.8802 val loss:0.2804 val acc:0.8976 time_cost:1m31s lr:0.001
epoch:3 train loss:0.3475 train acc:0.8822 val loss:0.3494 val acc:0.8693 time_cost:2m13s lr:0.001
epoch:4 train loss:0.2844 train acc:0.8989 val loss:0.2649 val acc:0.9025 time_cost:2m55s lr:0.001
epoch:5 train loss:0.2503 train acc:0.9119 val loss:0.2325 val acc:0.9178 time_cost:3m37s lr:0.001
epoch:6 train loss:0.2357 train acc:0.9177 val loss:0.2583 val acc:0.9074 time_cost:4m20s lr:0.001
epoch:7 train loss:0.2325 train acc:0.9193 val loss:0.2488 val acc:0.9143 time_cost:5m2s lr:0.001
epoch:8 train loss:0.2182 train acc:0.9240 val loss:0.2560 val acc:0.9112 time_cost:5m44s lr:0.001
epoch:9 train loss:5.1094 train acc:0.8837 val loss:0.2685 val acc:0.9029 time_cost:6m27s lr:0.001
epoch:10 train loss:0.2471 train acc:0.9141 val loss:0.2522 val acc:0.9139 time_cost:7m8s lr:0.001
epoch:11 train loss:0.2159 train acc:0.9240 val loss:0.2582 val acc:0.9123 time_cost:7m51s lr:0.001
epoch:12 train loss:0.2315 train acc:0.9210 val loss:0.2742 val acc:0.9038 time_cost:8m33s lr:0.001
epoch:13 train loss:0.2542 train acc:0.9183 val loss:0.4017 val acc:0.8602 time_cost:9m16s lr:0.001
epoch:14 train loss:0.2482 train acc:0.9164 val loss:0.2735 val acc:0.9088 time_cost:9m59s lr:0.001
epoch:15 train loss:0.2085 train acc:0.9282 val loss:0.2541 val acc:0.9152 time_cost:10m41s lr:0.001
epoch:16 train loss:0.2925 train acc:0.9052 val loss:0.2770 val acc:0.9070 time_cost:11m23s lr:0.001
epoch:17 train loss:1.1259 train acc:0.8038 val loss:0.4539 val acc:0.8606 time_cost:12m6s lr:0.001
epoch:18 train loss:0.6592 train acc:0.8111 val loss:0.4298 val acc:0.8503 time_cost:12m48s lr:0.001
epoch:19 train loss:0.5012 train acc:0.8381 val loss:0.3628 val acc:0.8820 time_cost:13m31s lr:0.001
epoch:20 train loss:0.4293 train acc:0.8626 val loss:0.3811 val acc:0.8802 time_cost:14m13s lr:0.001
