----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
         LeakyReLU-2           [-1, 64, 28, 28]               0
            Conv2d-3           [-1, 64, 28, 28]          36,928
         LeakyReLU-4           [-1, 64, 28, 28]               0
         MaxPool2d-5           [-1, 64, 14, 14]               0
            Conv2d-6          [-1, 128, 14, 14]          73,856
         LeakyReLU-7          [-1, 128, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]         147,584
         LeakyReLU-9          [-1, 128, 14, 14]               0
        MaxPool2d-10            [-1, 128, 7, 7]               0
           Conv2d-11            [-1, 256, 7, 7]         295,168
        LeakyReLU-12            [-1, 256, 7, 7]               0
           Conv2d-13            [-1, 256, 7, 7]         590,080
        LeakyReLU-14            [-1, 256, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         590,080
        LeakyReLU-16            [-1, 256, 7, 7]               0
        MaxPool2d-17            [-1, 256, 3, 3]               0
          Flatten-18                 [-1, 2304]               0
           Linear-19                  [-1, 512]       1,180,160
        LeakyReLU-20                  [-1, 512]               0
          Dropout-21                  [-1, 512]               0
           Linear-22                  [-1, 256]         131,328
        LeakyReLU-23                  [-1, 256]               0
          Dropout-24                  [-1, 256]               0
           Linear-25                   [-1, 10]           2,570
================================================================
Total params: 3,048,394
Trainable params: 3,048,394
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 3.07
Params size (MB): 11.63
Estimated Total Size (MB): 14.70
----------------------------------------------------------------
epoch:1 train loss:0.6718 train acc:0.7493 val loss:0.3985 val acc:0.8557 time_cost:0m44s lr:0.0001
epoch:2 train loss:0.3816 train acc:0.8623 val loss:0.3374 val acc:0.8789 time_cost:1m27s lr:0.0001
epoch:3 train loss:0.3154 train acc:0.8851 val loss:0.3019 val acc:0.8870 time_cost:2m9s lr:0.0001
epoch:4 train loss:0.2793 train acc:0.8985 val loss:0.2723 val acc:0.9004 time_cost:2m51s lr:0.0001
epoch:5 train loss:0.2477 train acc:0.9102 val loss:0.2535 val acc:0.9093 time_cost:3m33s lr:0.0001
epoch:6 train loss:0.2189 train acc:0.9200 val loss:0.2275 val acc:0.9190 time_cost:4m16s lr:0.0001
epoch:7 train loss:0.1962 train acc:0.9290 val loss:0.2351 val acc:0.9163 time_cost:4m59s lr:0.0001
epoch:8 train loss:0.1754 train acc:0.9360 val loss:0.2424 val acc:0.9168 time_cost:5m41s lr:0.0001
epoch:9 train loss:0.1548 train acc:0.9420 val loss:0.2333 val acc:0.9232 time_cost:6m23s lr:0.0001
epoch:10 train loss:0.1376 train acc:0.9495 val loss:0.2451 val acc:0.9220 time_cost:7m6s lr:0.0001
epoch:11 train loss:0.1194 train acc:0.9566 val loss:0.2322 val acc:0.9291 time_cost:7m48s lr:0.0001
epoch:12 train loss:0.1038 train acc:0.9613 val loss:0.2588 val acc:0.9267 time_cost:8m30s lr:0.0001
epoch:13 train loss:0.0895 train acc:0.9667 val loss:0.2618 val acc:0.9276 time_cost:9m13s lr:0.0001
epoch:14 train loss:0.0758 train acc:0.9728 val loss:0.2903 val acc:0.9225 time_cost:9m55s lr:0.0001
epoch:15 train loss:0.0688 train acc:0.9744 val loss:0.2684 val acc:0.9257 time_cost:10m37s lr:0.0001
epoch:16 train loss:0.0598 train acc:0.9782 val loss:0.2966 val acc:0.9292 time_cost:11m19s lr:0.0001
epoch:17 train loss:0.0515 train acc:0.9805 val loss:0.3094 val acc:0.9244 time_cost:12m1s lr:0.0001
epoch:18 train loss:0.0452 train acc:0.9838 val loss:0.3632 val acc:0.9302 time_cost:12m44s lr:0.0001
epoch:19 train loss:0.0445 train acc:0.9838 val loss:0.3271 val acc:0.9272 time_cost:13m26s lr:0.0001
epoch:20 train loss:0.0371 train acc:0.9858 val loss:0.3720 val acc:0.9223 time_cost:14m8s lr:0.0001
