----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
              ReLU-2           [-1, 64, 28, 28]               0
            Conv2d-3           [-1, 64, 28, 28]          36,928
              ReLU-4           [-1, 64, 28, 28]               0
         MaxPool2d-5           [-1, 64, 14, 14]               0
            Conv2d-6          [-1, 128, 14, 14]          73,856
              ReLU-7          [-1, 128, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]         147,584
              ReLU-9          [-1, 128, 14, 14]               0
        MaxPool2d-10            [-1, 128, 7, 7]               0
           Conv2d-11            [-1, 256, 7, 7]         295,168
             ReLU-12            [-1, 256, 7, 7]               0
           Conv2d-13            [-1, 256, 7, 7]         590,080
             ReLU-14            [-1, 256, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         590,080
             ReLU-16            [-1, 256, 7, 7]               0
        MaxPool2d-17            [-1, 256, 3, 3]               0
          Flatten-18                 [-1, 2304]               0
           Linear-19                  [-1, 512]       1,180,160
             ReLU-20                  [-1, 512]               0
          Dropout-21                  [-1, 512]               0
           Linear-22                  [-1, 256]         131,328
             ReLU-23                  [-1, 256]               0
          Dropout-24                  [-1, 256]               0
           Linear-25                   [-1, 10]           2,570
================================================================
Total params: 3,048,394
Trainable params: 3,048,394
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 3.07
Params size (MB): 11.63
Estimated Total Size (MB): 14.70
----------------------------------------------------------------
epoch:1train loss:0.6273 train acc:0.7688 val loss:0.3860 val acc:0.8608 time_cost:0m44s
epoch:2train loss:0.3528 train acc:0.8748 val loss:0.2894 val acc:0.8987 time_cost:1m27s
epoch:3train loss:0.2969 train acc:0.8974 val loss:0.2699 val acc:0.9073 time_cost:2m9s
epoch:4train loss:0.2628 train acc:0.9103 val loss:0.2571 val acc:0.9060 time_cost:2m51s
epoch:5train loss:0.2426 train acc:0.9164 val loss:0.2614 val acc:0.9103 time_cost:3m33s
epoch:6train loss:0.2240 train acc:0.9231 val loss:0.2644 val acc:0.9119 time_cost:4m15s
epoch:7train loss:0.2034 train acc:0.9293 val loss:0.2758 val acc:0.9096 time_cost:4m58s
epoch:8train loss:0.1950 train acc:0.9333 val loss:0.2620 val acc:0.9161 time_cost:5m40s
epoch:9train loss:0.1821 train acc:0.9363 val loss:0.3023 val acc:0.9130 time_cost:6m22s
epoch:10train loss:0.1940 train acc:0.9349 val loss:0.2486 val acc:0.9143 time_cost:7m4s
epoch:11train loss:0.1793 train acc:0.9404 val loss:0.2750 val acc:0.9184 time_cost:7m46s
epoch:12train loss:0.1711 train acc:0.9411 val loss:0.2561 val acc:0.9133 time_cost:8m28s
epoch:13train loss:0.1663 train acc:0.9429 val loss:0.2952 val acc:0.9124 time_cost:9m11s
epoch:14train loss:0.1612 train acc:0.9455 val loss:0.2528 val acc:0.9228 time_cost:9m53s
epoch:15train loss:0.1673 train acc:0.9436 val loss:0.2633 val acc:0.9169 time_cost:10m35s
epoch:16train loss:0.1550 train acc:0.9471 val loss:0.2651 val acc:0.9215 time_cost:11m17s
epoch:17train loss:0.1659 train acc:0.9457 val loss:0.2659 val acc:0.9158 time_cost:11m59s
epoch:18train loss:0.1503 train acc:0.9490 val loss:0.2910 val acc:0.9134 time_cost:12m41s
epoch:19train loss:0.1576 train acc:0.9479 val loss:0.3132 val acc:0.9153 time_cost:13m23s
epoch:20train loss:0.1637 train acc:0.9474 val loss:0.2918 val acc:0.9177 time_cost:14m5s
