----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
              ReLU-2           [-1, 64, 28, 28]               0
            Conv2d-3           [-1, 64, 28, 28]          36,928
              ReLU-4           [-1, 64, 28, 28]               0
         MaxPool2d-5           [-1, 64, 14, 14]               0
            Conv2d-6          [-1, 128, 14, 14]          73,856
              ReLU-7          [-1, 128, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]         147,584
              ReLU-9          [-1, 128, 14, 14]               0
        MaxPool2d-10            [-1, 128, 7, 7]               0
           Conv2d-11            [-1, 256, 7, 7]         295,168
             ReLU-12            [-1, 256, 7, 7]               0
           Conv2d-13            [-1, 256, 7, 7]         590,080
             ReLU-14            [-1, 256, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         590,080
             ReLU-16            [-1, 256, 7, 7]               0
        MaxPool2d-17            [-1, 256, 3, 3]               0
          Flatten-18                 [-1, 2304]               0
           Linear-19                  [-1, 512]       1,180,160
             ReLU-20                  [-1, 512]               0
          Dropout-21                  [-1, 512]               0
           Linear-22                  [-1, 256]         131,328
             ReLU-23                  [-1, 256]               0
          Dropout-24                  [-1, 256]               0
           Linear-25                   [-1, 10]           2,570
================================================================
Total params: 3,048,394
Trainable params: 3,048,394
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 3.07
Params size (MB): 11.63
Estimated Total Size (MB): 14.70
----------------------------------------------------------------
train loss:0.5912 train acc:0.7840 val loss:0.3570 val acc:0.8799 time_cost:0m49s
train loss:0.3414 train acc:0.8798 val loss:0.3108 val acc:0.8883 time_cost:1m31s
train loss:0.2886 train acc:0.8986 val loss:0.2625 val acc:0.9086 time_cost:2m13s
train loss:0.2582 train acc:0.9098 val loss:0.2595 val acc:0.9051 time_cost:2m55s
train loss:0.2359 train acc:0.9170 val loss:0.2401 val acc:0.9140 time_cost:3m37s
train loss:0.2179 train acc:0.9241 val loss:0.2429 val acc:0.9228 time_cost:4m19s
train loss:0.2079 train acc:0.9290 val loss:0.2896 val acc:0.8999 time_cost:5m1s
train loss:0.2008 train acc:0.9297 val loss:0.2539 val acc:0.9196 time_cost:5m43s
train loss:0.1887 train acc:0.9341 val loss:0.2516 val acc:0.9177 time_cost:6m26s
train loss:0.1779 train acc:0.9392 val loss:0.2657 val acc:0.9170 time_cost:7m9s
train loss:0.1782 train acc:0.9401 val loss:0.3069 val acc:0.9117 time_cost:7m53s
train loss:0.1726 train acc:0.9417 val loss:0.2713 val acc:0.9176 time_cost:8m35s
train loss:0.1673 train acc:0.9433 val loss:0.2668 val acc:0.9135 time_cost:9m17s
train loss:0.1722 train acc:0.9420 val loss:0.2900 val acc:0.9182 time_cost:9m59s
train loss:0.1583 train acc:0.9467 val loss:0.2718 val acc:0.9203 time_cost:10m41s
train loss:0.1477 train acc:0.9513 val loss:0.3064 val acc:0.9096 time_cost:11m24s
train loss:0.1558 train acc:0.9478 val loss:0.3393 val acc:0.9037 time_cost:12m6s
train loss:0.1534 train acc:0.9497 val loss:0.3042 val acc:0.9180 time_cost:12m49s
train loss:0.1649 train acc:0.9454 val loss:0.2647 val acc:0.9221 time_cost:13m31s
train loss:0.1495 train acc:0.9513 val loss:0.3023 val acc:0.9113 time_cost:14m13s
